python/python-keybindings.org
# -*- in-config-file: t; lexical-binding: t  -*-


PYTHON

| command           | function                                  |
|-------------------+-------------------------------------------|
| SHELL/INTERPRETER |                                           |
|-------------------+-------------------------------------------|
| ,ss               | Spawn Interpreter                         |
| ,sr               | Send region to shell                      |
| ,sl               | Send line to shell                        |
| ,sb               | Send entire buffer to shell               |
|                   |                                           |
|-------------------+-------------------------------------------|
| POETRY            |                                           |
|-------------------+-------------------------------------------|
| ,op               | Poetry transient mode                     |
| ,oa               | Add dependency in poetry                  |
| ,oi               | Install poetry deps                       |
| ,on               | New poetry environment                    |
|                   |                                           |
|-------------------+-------------------------------------------|
| Pipenv            |                                           |
|-------------------+-------------------------------------------|
| ,va               | activate env                              |
| ,vd               | deactivate env                            |
| ,vs               | spawn shell                               |
| ,vi               | install dep                               |
| ,vv               | fully activate env and launch interpreter |
|                   |                                           |
|-------------------+-------------------------------------------|
| INDENTATION       |                                           |
|-------------------+-------------------------------------------|
| ,il               | Shift region indentation to left          |
| ,ir               | Shift region indentation to right         |
|                   |                                           |
|-------------------+-------------------------------------------|
| MISC              |                                           |
|-------------------+-------------------------------------------|
| , c               | Complete (with company)                   |
|                   |                                           |



#+BEGIN_SRC emacs-lisp

(mode-binding 
:states '(normal motion)
:keymaps 'python-mode-map
"c" 'company-complete
"s" '(:ignore t :which-key "Talk to Interpreter")
"ss" '(run-python :which-key "Spawn Interpreter")
"sr" 'python-shell-send-region
"sl" 'python-shell-send-statement
"sb" 'python-shell-send-buffer
"o" '(:ignore t :which-key "Poetry")
"op" 'poetry
"oa" 'poetry-add-dep
"oi" 'poetry-install-install
"on" 'poetry-new
"v" '(:ignore t :which-key "Pipenv")
"va" 'pipenv-activate
"vd" 'pipenv-deactivate
"vs" 'pipenv-shell
"vi" 'pipenv-install
"vv" 'pipenv-full-activate
"i" '(:ignore t :which-key "Indententation")
"il" 'python-indent-shift-left
"ir" 'python-indent-shift-right
)


#+END_SRC
